{"format": "graph-model", "generatedBy": "1.10.1", "convertedBy": "TensorFlow.js Converter v1.2.9", "modelTopology": {"node": [{"name": "global_attention_pool_1/Reshape_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "global_attention_pool_1/attn_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "global_attention_pool_1/LG_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "global_attention_pool_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Reshape_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Reshape_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Reshape_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "arma_conv_2/Reshape_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "global_attention_pool_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/Reshape_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "arma_conv_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "118"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Reshape_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "118"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Reshape_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/Reshape_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "118"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Reshape_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_1/keras_learning_phase/input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "arma_conv_2/Reshape_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "global_attention_pool_1/Reshape_2/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "global_attention_pool_1/Reshape_2/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "global_attention_pool_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "200"}, {"size": "118"}]}}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "200"}, {"size": "200"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_1/keras_learning_phase", "op": "PlaceholderWithDefault", "input": ["arma_conv_1/dropout_1/keras_learning_phase/input"], "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "arma_conv_1/Reshape", "op": "Reshape", "input": ["input_1", "arma_conv_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/Shape", "op": "Shape", "input": ["input_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/dropout_1/cond/Switch_1", "op": "Switch", "input": ["input_1", "arma_conv_1/dropout_1/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_3/cond/Switch", "op": "Switch", "input": ["arma_conv_1/dropout_1/keras_learning_phase", "arma_conv_1/dropout_1/keras_learning_phase"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "arma_conv_1/MatMul", "op": "MatMul", "input": ["arma_conv_1/Reshape", "arma_conv_1/Reshape_1"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/unstack", "op": "Unpack", "input": ["arma_conv_1/Shape"], "attr": {"T": {"type": "DT_INT32"}, "num": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "arma_conv_2/dropout_3/cond/switch_t", "op": "Identity", "input": ["arma_conv_2/dropout_3/cond/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "arma_conv_1/Reshape_2/shape", "op": "Pack", "input": ["arma_conv_1/unstack", "global_attention_pool_1/Reshape_2/shape/1", "global_attention_pool_1/Reshape_2/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "ConstantFolding/arma_conv_2/dropout_3/cond/dropout/div_recip", "op": "Const", "input": ["^arma_conv_2/dropout_3/cond/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_3/cond/dropout/keep_prob", "op": "Const", "input": ["^arma_conv_2/dropout_3/cond/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_3/cond/mul/y", "op": "Const", "input": ["^arma_conv_2/dropout_3/cond/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Reshape_2", "op": "Reshape", "input": ["arma_conv_1/MatMul", "arma_conv_1/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/dropout_1/cond/mul", "op": "Mul", "input": ["arma_conv_1/dropout_1/cond/Switch_1:1", "arma_conv_2/dropout_3/cond/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/MatMul_1", "op": "BatchMatMul", "input": ["input_2", "arma_conv_1/Reshape_2"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "arma_conv_1/dropout_1/cond/dropout/div", "op": "Mul", "input": ["ConstantFolding/arma_conv_2/dropout_3/cond/dropout/div_recip", "arma_conv_1/dropout_1/cond/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_1/cond/dropout/Shape", "op": "Shape", "input": ["arma_conv_1/dropout_1/cond/mul"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_1/cond/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["arma_conv_1/dropout_1/cond/dropout/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "8129762"}, "seed": {"i": "87654321"}, "T": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/dropout_2/cond/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["arma_conv_1/dropout_1/cond/dropout/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "7136642"}, "seed": {"i": "87654321"}, "T": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/dropout_1/cond/dropout/random_uniform/mul", "op": "Mul", "input": ["arma_conv_1/dropout_1/cond/dropout/random_uniform/RandomUniform", "arma_conv_2/dropout_3/cond/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_2/cond/dropout/random_uniform/mul", "op": "Mul", "input": ["arma_conv_1/dropout_2/cond/dropout/random_uniform/RandomUniform", "arma_conv_2/dropout_3/cond/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_1/cond/dropout/add", "op": "Add", "input": ["arma_conv_1/dropout_1/cond/dropout/random_uniform/mul", "arma_conv_2/dropout_3/cond/dropout/keep_prob"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_2/cond/dropout/add", "op": "Add", "input": ["arma_conv_1/dropout_2/cond/dropout/random_uniform/mul", "arma_conv_2/dropout_3/cond/dropout/keep_prob"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_1/cond/dropout/Floor", "op": "Floor", "input": ["arma_conv_1/dropout_1/cond/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_2/cond/dropout/Floor", "op": "Floor", "input": ["arma_conv_1/dropout_2/cond/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_1/cond/dropout/mul", "op": "Mul", "input": ["arma_conv_1/dropout_1/cond/dropout/Floor", "arma_conv_1/dropout_1/cond/dropout/div"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_2/cond/dropout/mul", "op": "Mul", "input": ["arma_conv_1/dropout_1/cond/dropout/div", "arma_conv_1/dropout_2/cond/dropout/Floor"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/dropout_1/cond/Merge", "op": "Merge", "input": ["arma_conv_1/dropout_1/cond/Switch_1", "arma_conv_1/dropout_1/cond/dropout/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "arma_conv_1/dropout_2/cond/Merge", "op": "Merge", "input": ["arma_conv_1/dropout_1/cond/Switch_1", "arma_conv_1/dropout_2/cond/dropout/mul"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Reshape_3", "op": "Reshape", "input": ["arma_conv_1/dropout_1/cond/Merge", "arma_conv_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/Shape_2", "op": "Shape", "input": ["arma_conv_1/dropout_1/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/Reshape_10", "op": "Reshape", "input": ["arma_conv_1/dropout_2/cond/Merge", "arma_conv_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/Shape_6", "op": "Shape", "input": ["arma_conv_1/dropout_2/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/MatMul_2", "op": "MatMul", "input": ["arma_conv_1/Reshape_3", "arma_conv_1/Reshape_4"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "arma_conv_1/unstack_2", "op": "Unpack", "input": ["arma_conv_1/Shape_2"], "attr": {"T": {"type": "DT_INT32"}, "num": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "arma_conv_1/MatMul_5", "op": "MatMul", "input": ["arma_conv_1/Reshape_10", "arma_conv_1/Reshape_11"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/unstack_6", "op": "Unpack", "input": ["arma_conv_1/Shape_6"], "attr": {"T": {"type": "DT_INT32"}, "num": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "arma_conv_1/Reshape_5/shape", "op": "Pack", "input": ["arma_conv_1/unstack_2", "global_attention_pool_1/Reshape_2/shape/1", "global_attention_pool_1/Reshape_2/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "arma_conv_1/Reshape_12/shape", "op": "Pack", "input": ["arma_conv_1/unstack_6", "global_attention_pool_1/Reshape_2/shape/1", "global_attention_pool_1/Reshape_2/shape/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/Reshape_5", "op": "Reshape", "input": ["arma_conv_1/MatMul_2", "arma_conv_1/Reshape_5/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Reshape_12", "op": "Reshape", "input": ["arma_conv_1/MatMul_5", "arma_conv_1/Reshape_12/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/add", "op": "Add", "input": ["arma_conv_1/Reshape_5", "arma_conv_1/Reshape_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/add_2", "op": "Add", "input": ["arma_conv_1/Reshape_12", "arma_conv_1/Reshape_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/add_1", "op": "Add", "input": ["arma_conv_1/MatMul_1", "arma_conv_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Relu", "op": "Relu", "input": ["arma_conv_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Reshape_7", "op": "Reshape", "input": ["arma_conv_1/Relu", "global_attention_pool_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/Shape_4", "op": "Shape", "input": ["arma_conv_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/MatMul_3", "op": "MatMul", "input": ["arma_conv_1/Reshape_7", "arma_conv_1/Reshape_8"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "arma_conv_1/unstack_4", "op": "Unpack", "input": ["arma_conv_1/Shape_4"], "attr": {"T": {"type": "DT_INT32"}, "num": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "arma_conv_1/Reshape_9/shape", "op": "Pack", "input": ["arma_conv_1/unstack_4", "global_attention_pool_1/Reshape_2/shape/1", "global_attention_pool_1/Reshape_2/shape/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "arma_conv_1/Reshape_9", "op": "Reshape", "input": ["arma_conv_1/MatMul_3", "arma_conv_1/Reshape_9/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_1/MatMul_4", "op": "BatchMatMul", "input": ["input_2", "arma_conv_1/Reshape_9"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/add_3", "op": "Add", "input": ["arma_conv_1/MatMul_4", "arma_conv_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Relu_1", "op": "Relu", "input": ["arma_conv_1/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/ExpandDims", "op": "ExpandDims", "input": ["arma_conv_1/Relu_1", "arma_conv_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/average_pooling2d_1/AvgPool", "op": "AvgPool", "input": ["arma_conv_1/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "arma_conv_1/Squeeze", "op": "Squeeze", "input": ["arma_conv_1/average_pooling2d_1/AvgPool"], "attr": {"squeeze_dims": {"list": {"i": ["-1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_1/Relu_2", "op": "Relu", "input": ["arma_conv_1/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Reshape", "op": "Reshape", "input": ["arma_conv_1/Relu_2", "global_attention_pool_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/Shape", "op": "Shape", "input": ["arma_conv_1/Relu_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/dropout_3/cond/Switch_1", "op": "Switch", "input": ["arma_conv_1/Relu_2", "arma_conv_1/dropout_1/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/MatMul", "op": "MatMul", "input": ["arma_conv_2/Reshape", "arma_conv_2/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "arma_conv_2/unstack", "op": "Unpack", "input": ["arma_conv_2/Shape"], "attr": {"T": {"type": "DT_INT32"}, "num": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "arma_conv_2/dropout_3/cond/dropout/div", "op": "Mul", "input": ["ConstantFolding/arma_conv_2/dropout_3/cond/dropout/div_recip", "arma_conv_2/dropout_3/cond/Switch_1:1", "^arma_conv_2/dropout_3/cond/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_3/cond/dropout/Shape", "op": "Shape", "input": ["arma_conv_2/dropout_3/cond/Switch_1:1", "^arma_conv_2/dropout_3/cond/mul/y"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Reshape_2/shape", "op": "Pack", "input": ["arma_conv_2/unstack", "global_attention_pool_1/Reshape_2/shape/1", "global_attention_pool_1/Reshape_2/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "arma_conv_2/dropout_3/cond/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["arma_conv_2/dropout_3/cond/dropout/Shape"], "attr": {"T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "3225833"}, "seed": {"i": "87654321"}}}, {"name": "arma_conv_2/dropout_4/cond/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["arma_conv_2/dropout_3/cond/dropout/Shape"], "attr": {"seed2": {"i": "4302914"}, "seed": {"i": "87654321"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Reshape_2", "op": "Reshape", "input": ["arma_conv_2/MatMul", "arma_conv_2/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/dropout_3/cond/dropout/add", "op": "Add", "input": ["arma_conv_2/dropout_3/cond/dropout/keep_prob", "arma_conv_2/dropout_3/cond/dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_4/cond/dropout/add", "op": "Add", "input": ["arma_conv_2/dropout_3/cond/dropout/keep_prob", "arma_conv_2/dropout_4/cond/dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/MatMul_1", "op": "BatchMatMul", "input": ["input_2", "arma_conv_2/Reshape_2"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_3/cond/dropout/Floor", "op": "Floor", "input": ["arma_conv_2/dropout_3/cond/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_4/cond/dropout/Floor", "op": "Floor", "input": ["arma_conv_2/dropout_4/cond/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_3/cond/dropout/mul", "op": "Mul", "input": ["arma_conv_2/dropout_3/cond/dropout/Floor", "arma_conv_2/dropout_3/cond/dropout/div"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_4/cond/dropout/mul", "op": "Mul", "input": ["arma_conv_2/dropout_3/cond/dropout/div", "arma_conv_2/dropout_4/cond/dropout/Floor"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/dropout_3/cond/Merge", "op": "Merge", "input": ["arma_conv_2/dropout_3/cond/Switch_1", "arma_conv_2/dropout_3/cond/dropout/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "arma_conv_2/dropout_4/cond/Merge", "op": "Merge", "input": ["arma_conv_2/dropout_3/cond/Switch_1", "arma_conv_2/dropout_4/cond/dropout/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "arma_conv_2/Reshape_3", "op": "Reshape", "input": ["arma_conv_2/dropout_3/cond/Merge", "global_attention_pool_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/Shape_2", "op": "Shape", "input": ["arma_conv_2/dropout_3/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/Reshape_10", "op": "Reshape", "input": ["arma_conv_2/dropout_4/cond/Merge", "global_attention_pool_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/Shape_6", "op": "Shape", "input": ["arma_conv_2/dropout_4/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/MatMul_2", "op": "MatMul", "input": ["arma_conv_2/Reshape_3", "arma_conv_2/Reshape_4"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/unstack_2", "op": "Unpack", "input": ["arma_conv_2/Shape_2"], "attr": {"T": {"type": "DT_INT32"}, "num": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "arma_conv_2/MatMul_5", "op": "MatMul", "input": ["arma_conv_2/Reshape_10", "arma_conv_2/Reshape_11"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/unstack_6", "op": "Unpack", "input": ["arma_conv_2/Shape_6"], "attr": {"T": {"type": "DT_INT32"}, "num": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "arma_conv_2/Reshape_5/shape", "op": "Pack", "input": ["arma_conv_2/unstack_2", "global_attention_pool_1/Reshape_2/shape/1", "global_attention_pool_1/Reshape_2/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "arma_conv_2/Reshape_12/shape", "op": "Pack", "input": ["arma_conv_2/unstack_6", "global_attention_pool_1/Reshape_2/shape/1", "global_attention_pool_1/Reshape_2/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "arma_conv_2/Reshape_5", "op": "Reshape", "input": ["arma_conv_2/MatMul_2", "arma_conv_2/Reshape_5/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/Reshape_12", "op": "Reshape", "input": ["arma_conv_2/MatMul_5", "arma_conv_2/Reshape_12/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/add", "op": "Add", "input": ["arma_conv_2/Reshape_5", "arma_conv_2/Reshape_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/add_2", "op": "Add", "input": ["arma_conv_2/Reshape_12", "arma_conv_2/Reshape_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/add_1", "op": "Add", "input": ["arma_conv_2/MatMul_1", "arma_conv_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Relu", "op": "Relu", "input": ["arma_conv_2/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Reshape_7", "op": "Reshape", "input": ["arma_conv_2/Relu", "global_attention_pool_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/Shape_4", "op": "Shape", "input": ["arma_conv_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/MatMul_3", "op": "MatMul", "input": ["arma_conv_2/Reshape_7", "arma_conv_2/Reshape_8"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "arma_conv_2/unstack_4", "op": "Unpack", "input": ["arma_conv_2/Shape_4"], "attr": {"T": {"type": "DT_INT32"}, "num": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "arma_conv_2/Reshape_9/shape", "op": "Pack", "input": ["arma_conv_2/unstack_4", "global_attention_pool_1/Reshape_2/shape/1", "global_attention_pool_1/Reshape_2/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "arma_conv_2/Reshape_9", "op": "Reshape", "input": ["arma_conv_2/MatMul_3", "arma_conv_2/Reshape_9/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "arma_conv_2/MatMul_4", "op": "BatchMatMul", "input": ["input_2", "arma_conv_2/Reshape_9"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/add_3", "op": "Add", "input": ["arma_conv_2/MatMul_4", "arma_conv_2/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/Relu_1", "op": "Relu", "input": ["arma_conv_2/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/ExpandDims", "op": "ExpandDims", "input": ["arma_conv_2/Relu_1", "arma_conv_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "arma_conv_2/average_pooling2d_2/AvgPool", "op": "AvgPool", "input": ["arma_conv_2/ExpandDims"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "ksize": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "arma_conv_2/Squeeze", "op": "Squeeze", "input": ["arma_conv_2/average_pooling2d_2/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-1"]}}}}, {"name": "arma_conv_2/Relu_2", "op": "Relu", "input": ["arma_conv_2/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "global_attention_pool_1/Reshape", "op": "Reshape", "input": ["arma_conv_2/Relu_2", "global_attention_pool_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "global_attention_pool_1/Shape", "op": "Shape", "input": ["arma_conv_2/Relu_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "global_attention_pool_1/MatMul_1", "op": "MatMul", "input": ["global_attention_pool_1/Reshape", "global_attention_pool_1/Reshape_4"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "global_attention_pool_1/MatMul", "op": "MatMul", "input": ["global_attention_pool_1/Reshape", "global_attention_pool_1/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "global_attention_pool_1/unstack", "op": "Unpack", "input": ["global_attention_pool_1/Shape"], "attr": {"T": {"type": "DT_INT32"}, "num": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "global_attention_pool_1/Reshape_2/shape", "op": "Pack", "input": ["global_attention_pool_1/unstack", "global_attention_pool_1/Reshape_2/shape/1", "global_attention_pool_1/Reshape_2/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "global_attention_pool_1/Reshape_5", "op": "Reshape", "input": ["global_attention_pool_1/MatMul_1", "global_attention_pool_1/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "global_attention_pool_1/Reshape_2", "op": "Reshape", "input": ["global_attention_pool_1/MatMul", "global_attention_pool_1/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "global_attention_pool_1/add_1", "op": "Add", "input": ["global_attention_pool_1/Reshape_5", "global_attention_pool_1/attn_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "global_attention_pool_1/add", "op": "Add", "input": ["global_attention_pool_1/LG_bias", "global_attention_pool_1/Reshape_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "global_attention_pool_1/Sigmoid", "op": "Sigmoid", "input": ["global_attention_pool_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "global_attention_pool_1/mul", "op": "Mul", "input": ["global_attention_pool_1/Sigmoid", "global_attention_pool_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "global_attention_pool_1/Sum", "op": "Sum", "input": ["global_attention_pool_1/mul", "global_attention_pool_1/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "dense_1/MatMul", "op": "MatMul", "input": ["global_attention_pool_1/Sum", "dense_1/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_1/BiasAdd", "op": "BiasAdd", "input": ["dense_1/MatMul", "dense_1/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "dense_1/Relu", "op": "Relu", "input": ["dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_2/MatMul", "op": "MatMul", "input": ["dense_1/Relu", "dense_2/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "dense_2/BiasAdd", "op": "BiasAdd", "input": ["dense_2/MatMul", "dense_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_2/Sigmoid", "op": "Sigmoid", "input": ["dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.dat"], "weights": [{"name": "global_attention_pool_1/Reshape_4", "shape": [64, 64], "dtype": "float32"}, {"name": "global_attention_pool_1/attn_bias", "shape": [64], "dtype": "float32"}, {"name": "global_attention_pool_1/LG_bias", "shape": [64], "dtype": "float32"}, {"name": "global_attention_pool_1/Reshape_1", "shape": [64, 64], "dtype": "float32"}, {"name": "arma_conv_2/Reshape_8", "shape": [64, 64], "dtype": "float32"}, {"name": "arma_conv_2/Reshape_1", "shape": [64, 64], "dtype": "float32"}, {"name": "arma_conv_2/Reshape_4", "shape": [64, 64], "dtype": "float32"}, {"name": "arma_conv_2/Reshape_6", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "arma_conv_2/Reshape_11", "shape": [64, 64], "dtype": "float32"}, {"name": "global_attention_pool_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "arma_conv_1/Reshape_8", "shape": [64, 64], "dtype": "float32"}, {"name": "arma_conv_1/Reshape_1", "shape": [118, 64], "dtype": "float32"}, {"name": "arma_conv_1/Reshape_4", "shape": [118, 64], "dtype": "float32"}, {"name": "arma_conv_1/Reshape_6", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "arma_conv_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "arma_conv_1/Reshape_11", "shape": [118, 64], "dtype": "float32"}, {"name": "arma_conv_1/Reshape_13", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "arma_conv_1/dropout_1/keras_learning_phase/input", "shape": [], "dtype": "bool"}, {"name": "arma_conv_2/Reshape_13", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "arma_conv_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "global_attention_pool_1/Reshape_2/shape/1", "shape": [], "dtype": "int32"}, {"name": "global_attention_pool_1/Reshape_2/shape/2", "shape": [], "dtype": "int32"}, {"name": "global_attention_pool_1/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "dense_1/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [64, 2], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [2], "dtype": "float32"}, {"name": "ConstantFolding/arma_conv_2/dropout_3/cond/dropout/div_recip", "shape": [], "dtype": "float32"}, {"name": "arma_conv_2/dropout_3/cond/dropout/keep_prob", "shape": [], "dtype": "float32"}, {"name": "arma_conv_2/dropout_3/cond/mul/y", "shape": [], "dtype": "float32"}]}]}